In [1]:
string_data = pd.Series(['aardvark', 'artichoke', 
                         np.nan, 'avocado'])
string_data

NameError: name 'pd' is not defined

In [2]:
import numpy as np

In [3]:
import pandas as pd
from pandas import Series, DataFrame

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', 
                         np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
 [NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned = data.dropna()

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df

          0         1         2
0 -0.064938 -2.275927 -0.562847
1 -0.366261  0.263195 -0.179823
2 -2.187160  1.076035  0.249774
3 -1.068879  0.376485 -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [24]:
df.iloc[:4, 1] = NA

In [25]:
df

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [26]:
df.dropna()

          0         1         2
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [27]:
df

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [28]:
df.dropna(thresh=2)

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [29]:
df.dropna(thresh = 2)

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [30]:
df.dropna(thresh = 1)

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [31]:
df.fillna(0)

          0         1         2
0 -0.064938  0.000000 -0.562847
1 -0.366261  0.000000 -0.179823
2 -2.187160  0.000000  0.249774
3 -1.068879  0.000000 -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [32]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.064938  0.500000 -0.562847
1 -0.366261  0.500000 -0.179823
2 -2.187160  0.500000  0.249774
3 -1.068879  0.500000 -0.386209
4 -2.572861  1.094499  1.455375
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [33]:
df.iloc[4, 2] = NA

In [34]:
df

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499       NaN
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [35]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.064938  0.500000 -0.562847
1 -0.366261  0.500000 -0.179823
2 -2.187160  0.500000  0.249774
3 -1.068879  0.500000 -0.386209
4 -2.572861  1.094499  0.000000
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [36]:
df

          0         1         2
0 -0.064938       NaN -0.562847
1 -0.366261       NaN -0.179823
2 -2.187160       NaN  0.249774
3 -1.068879       NaN -0.386209
4 -2.572861  1.094499       NaN
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [37]:
_ = df.fillna(0, inplace=True)

In [38]:
df

          0         1         2
0 -0.064938  0.000000 -0.562847
1 -0.366261  0.000000 -0.179823
2 -2.187160  0.000000  0.249774
3 -1.068879  0.000000 -0.386209
4 -2.572861  1.094499  0.000000
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [39]:
df

          0         1         2
0 -0.064938  0.000000 -0.562847
1 -0.366261  0.000000 -0.179823
2 -2.187160  0.000000  0.249774
3 -1.068879  0.000000 -0.386209
4 -2.572861  1.094499  0.000000
5 -0.150806  0.915053  0.076530
6 -0.075853 -1.855101 -0.803961

In [40]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.733369  0.969918 -0.300648
1 -1.017933  0.296854  0.532277
2 -0.213461       NaN  0.517909
3 -0.005808       NaN  0.098521
4 -0.778057       NaN       NaN
5  1.737409       NaN       NaN

In [41]:
df.fillna(method = 'ffill')

          0         1         2
0  1.733369  0.969918 -0.300648
1 -1.017933  0.296854  0.532277
2 -0.213461  0.296854  0.517909
3 -0.005808  0.296854  0.098521
4 -0.778057  0.296854  0.098521
5  1.737409  0.296854  0.098521

In [42]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.733369  0.969918 -0.300648
1 -1.017933  0.296854  0.532277
2 -0.213461  0.296854  0.517909
3 -0.005808  0.296854  0.098521
4 -0.778057       NaN  0.098521
5  1.737409       NaN  0.098521

In [43]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [44]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [45]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [46]:
11.5/3

3.8333333333333335

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [50]:
data['v1'] = range(7)

In [51]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [54]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon',
                        'Pastrami', 'corned beef','bacon'
                              'pastrami', 'honey ham', 'nova lox'],
                             'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
                                        data

IndentationError: unexpected indent (<ipython-input-55-728acfc7599f>, line 5)

In [56]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon',
                        'Pastrami', 'corned beef','bacon'
                              'pastrami', 'honey ham', 'nova lox'],
                             'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

ValueError: arrays must all be same length

In [57]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon', 'Pastrami', 
                              'corned beef','bacon','pastrami', 'honey ham', 'nova lox'],
                             'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [58]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [59]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [68]:
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [61]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon', 'Pastrami', 
                              'corned beef','Bacon','pastrami', 'honey ham', 'nova lox'],
                             'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [62]:
lowercased = data['food'].str.lower()

In [63]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [64]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [65]:
data['animal'] = lowercased.map(meat_to_animal)

In [66]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
x.lower()

NameError: name 'x' is not defined

In [69]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [70]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [71]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [72]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [74]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [75]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [76]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 index=['Ohio', 'Colorado', 'New York'],
 columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [79]:
transform = lambda x: x[:4].upper()

In [80]:
transform

In [81]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [82]:
data.index = data.index.map(transform)

In [83]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [84]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [85]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [86]:
data.rename(index={'OHIO': 'INDIANA'},
columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [87]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [88]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [89]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [90]:
age

NameError: name 'age' is not defined

In [91]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [92]:
bins = [18, 25, 35, 60, 100]

In [93]:
cats = pd.cut(ages, bins)

In [94]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [95]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [96]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [97]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [98]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [99]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [100]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 
               'Senior']

In [101]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [102]:
data = np.random.rand(20)

In [103]:
pd.cut(data, 4, precision=2)

[(0.34, 0.55], (0.75, 0.96], (0.34, 0.55], (0.55, 0.75], (0.13, 0.34], ..., (0.75, 0.96], (0.34, 0.55], (0.75, 0.96], (0.13, 0.34], (0.55, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.13, 0.34] < (0.34, 0.55] < (0.55, 0.75] < (0.75, 0.96]]

In [104]:
data = np.random.randn(1000)""

SyntaxError: invalid syntax (<ipython-input-104-5cc6d09863b8>, line 1)

In [105]:
data = np.random.randn(1000)

In [106]:
cats = pd.qcut(data, 4)

In [107]:
cats

[(-3.0749999999999997, -0.621], (0.687, 3.056], (-3.0749999999999997, -0.621], (0.0285, 0.687], (0.687, 3.056], ..., (0.0285, 0.687], (-3.0749999999999997, -0.621], (0.0285, 0.687], (-3.0749999999999997, -0.621], (0.687, 3.056]]
Length: 1000
Categories (4, interval[float64]): [(-3.0749999999999997, -0.621] < (-0.621, 0.0285] < (0.0285, 0.687] < (0.687, 3.056]]

In [108]:
pd.value_counts(cats)

(0.687, 3.056]                   250
(0.0285, 0.687]                  250
(-0.621, 0.0285]                 250
(-3.0749999999999997, -0.621]    250
dtype: int64

In [109]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.286, 0.0285], (1.277, 3.056], (-3.0749999999999997, -1.286], (0.0285, 1.277], (1.277, 3.056], ..., (0.0285, 1.277], (-1.286, 0.0285], (0.0285, 1.277], (-3.0749999999999997, -1.286], (0.0285, 1.277]]
Length: 1000
Categories (4, interval[float64]): [(-3.0749999999999997, -1.286] < (-1.286, 0.0285] < (0.0285, 1.277] < (1.277, 3.056]]

In [110]:
pd.value_counts(cats)

(0.687, 3.056]                   250
(0.0285, 0.687]                  250
(-0.621, 0.0285]                 250
(-3.0749999999999997, -0.621]    250
dtype: int64

In [111]:
cats2 = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [112]:
pd.value_counts(cats2)

(0.0285, 1.277]                  400
(-1.286, 0.0285]                 400
(1.277, 3.056]                   100
(-3.0749999999999997, -1.286]    100
dtype: int64

In [113]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [114]:
data.size()

TypeError: 'numpy.int32' object is not callable

In [115]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.049961     0.013020     0.018826     0.008065
std       0.997107     0.974430     1.004260     1.019116
min      -2.968394    -3.516918    -3.485839    -3.084501
25%      -0.767147    -0.590132    -0.660091    -0.669946
50%      -0.045293    -0.012555     0.023976     0.009390
75%       0.637210     0.654533     0.667264     0.725884
max       3.079545     3.211593     3.150454     3.748036

In [116]:
col = data[2]

In [117]:
col[np.abs(col) > 3]

516   -3.485839
643    3.150454
816    3.141175
Name: 2, dtype: float64

In [118]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
82   3.079545 -0.378200  1.324654  0.462861
244  1.929906 -3.516918 -0.318265 -0.024085
249  0.205943 -0.792535 -0.282494 -3.084501
399 -1.583047 -0.162466 -0.210903  3.567939
421  1.020366 -1.636204 -0.755425  3.059646
484  1.088642  2.159018 -2.481129  3.748036
516 -0.739774  1.176541 -3.485839 -1.742026
525  1.637753  3.211593 -0.266854  1.128502
632  0.637155 -3.194205  1.992324 -2.130164
643  0.083134 -1.155799  3.150454  1.309363
677 -0.142029 -0.094930  1.861580  3.015673
816 -0.842077 -0.703280  3.141175  1.047364

In [119]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [120]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.050041     0.013520     0.019020     0.006759
std       0.996860     0.971395     1.001790     1.014327
min      -2.968394    -3.000000    -3.000000    -3.000000
25%      -0.767147    -0.590132    -0.660091    -0.669946
50%      -0.045293    -0.012555     0.023976     0.009390
75%       0.637210     0.654533     0.667264     0.725884
max       3.000000     3.000000     3.000000     3.000000

In [121]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0 -1.0

In [122]:
np.sign(data)

       0    1    2    3
0    1.0  1.0  1.0 -1.0
1   -1.0 -1.0 -1.0 -1.0
2    1.0  1.0 -1.0 -1.0
3    1.0  1.0  1.0  1.0
4    1.0  1.0  1.0 -1.0
5    1.0  1.0  1.0  1.0
6   -1.0  1.0  1.0  1.0
7    1.0  1.0  1.0  1.0
8    1.0  1.0  1.0  1.0
9    1.0 -1.0  1.0 -1.0
10   1.0  1.0  1.0  1.0
11   1.0  1.0 -1.0 -1.0
12  -1.0  1.0  1.0  1.0
13   1.0 -1.0 -1.0  1.0
14  -1.0  1.0  1.0 -1.0
15  -1.0  1.0  1.0 -1.0
16  -1.0  1.0  1.0  1.0
17   1.0 -1.0 -1.0 -1.0
18   1.0 -1.0 -1.0 -1.0
19   1.0  1.0  1.0  1.0
20   1.0  1.0  1.0  1.0
21  -1.0  1.0 -1.0  1.0
22  -1.0  1.0 -1.0 -1.0
23  -1.0 -1.0  1.0  1.0
24   1.0 -1.0 -1.0 -1.0
25  -1.0  1.0 -1.0  1.0
26   1.0 -1.0  1.0  1.0
27  -1.0 -1.0  1.0  1.0
28   1.0  1.0 -1.0 -1.0
29  -1.0  1.0 -1.0  1.0
..   ...  ...  ...  ...
970 -1.0  1.0 -1.0  1.0
971  1.0  1.0 -1.0 -1.0
972  1.0  1.0 -1.0  1.0
973  1.0 -1.0 -1.0 -1.0
974 -1.0 -1.0 -1.0 -1.0
975  1.0 -1.0  1.0  1.0
976 -1.0  1.0  1.0  1.0
977  1.0  1.0 -1.0  1.0
978 -1.0 -1.0  1.0  1.0
979  1.0 -1.0  1.0  1.0
980  1.0  1.0 -1.0  1.0
981  1.0  1.0 -1.0 -1.0
982 -1.0  1.0  1.0  1.0
983  1.0  1.0 -1.0 -1.0
984 -1.0  1.0 -1.0  1.0
985 -1.0 -1.0 -1.0  1.0
986  1.0  1.0 -1.0 -1.0
987 -1.0 -1.0  1.0  1.0
988  1.0 -1.0 -1.0  1.0
989 -1.0  1.0 -1.0 -1.0
990  1.0 -1.0  1.0  1.0
991 -1.0 -1.0  1.0 -1.0
992  1.0  1.0 -1.0 -1.0
993 -1.0  1.0 -1.0  1.0
994  1.0 -1.0 -1.0  1.0
995 -1.0 -1.0  1.0  1.0
996 -1.0  1.0  1.0 -1.0
997 -1.0  1.0  1.0  1.0
998  1.0 -1.0  1.0 -1.0
999 -1.0 -1.0 -1.0 -1.0

[1000 rows x 4 columns]

In [123]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [124]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [125]:
sampler = np.random.permutation(5)

In [126]:
sampler

array([0, 4, 3, 2, 1])

In [127]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [128]:
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
0  0  1   2   3
2  8  9  10  11

In [129]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [130]:
choices = pd.Series([5, 7, -1, 6, 4])

In [131]:
draws = choices.sample(n=10, replace=True)

In [132]:
draws

0    5
0    5
4    4
3    6
1    7
3    6
0    5
1    7
0    5
4    4
dtype: int64

In [133]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'data1': range(6)})

SyntaxError: invalid syntax (<ipython-input-133-9edf6c6b518e>, line 1)

In [134]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a','b'] 'data1': range(6)})

SyntaxError: invalid syntax (<ipython-input-134-eb7d6b25b73a>, line 1)

In [135]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a','b'], 'data1': range(6)})

In [136]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [137]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a','b'] 'data1': range(6)})

SyntaxError: invalid syntax (<ipython-input-137-eb7d6b25b73a>, line 1)

In [138]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [139]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [140]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [141]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [142]:
mnames = ['movie_id', 'title', 'genres']

In [143]:
movies = pd.read_table('datasets/movielens/movies.dat', 
                        header=None, names=mnames)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

FileNotFoundError: [Errno 2] File b'datasets/movielens/movies.dat' does not exist: b'datasets/movielens/movies.dat'

In [144]:
np.random.seed(12345)

In [145]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [146]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [147]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [148]:
val = 'a,b, guido'

In [149]:
val.split(',')

['a', 'b', ' guido']

In [150]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [151]:
first, second, third = pieces

In [152]:
first + '::' + second + '::' + third

'a::b::guido'

In [153]:
'::'.join(pieces)

'a::b::guido'

In [154]:
'guido' in val

True

In [155]:
val.index(',')

1

In [156]:
val

'a,b, guido'

In [157]:
val2 = '::'.join(pieces)

In [158]:
val2

'a::b::guido'

In [159]:
val2.index(',')

ValueError: substring not found

In [160]:
val.index('::')

ValueError: substring not found

In [161]:
val2.index('::')

1

In [162]:
val.index('g')

5

In [163]:
val

'a,b, guido'

In [164]:
val.find(':')

-1

In [165]:
val.find(',')

1

In [166]:
val.find('g')

5

In [167]:
val.count(',')

2

In [168]:
val.replace(',', '::')

'a::b:: guido'

In [169]:
val

'a,b, guido'

In [170]:
val.replace(',', '')

'ab guido'

In [171]:
import re

In [172]:
text = "foo  bar\t baz \tqux"

In [173]:
text

'foo  bar\t baz \tqux'

In [174]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [175]:
text

'foo  bar\t baz \tqux'

In [176]:
regex = re.compile('\s+')

In [177]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [178]:
regex.findall(text)

['  ', '\t ', ' \t']

In [179]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [180]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [181]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [182]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [183]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [184]:
m = regex.search(text)

In [185]:
m

In [186]:
text[m.start(:m.end())]

SyntaxError: invalid syntax (<ipython-input-186-035c9e9db397>, line 1)

In [187]:
text[m.start():m.end()]

'dave@google.com'

In [188]:
print(regex.match(text))

None

In [189]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [190]:
regex.sub('REDACTED', text)

'Dave REDACTED\nSteve REDACTED\nRob REDACTED\nRyan REDACTED\n'

In [191]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [192]:
m = regex.match('wesm@bright.net')

In [193]:
m.groups()

('wesm', 'bright', 'net')

In [194]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [195]:
In [166]: print(regex.sub(r'Username: \1, Domain: \2, Suffix: Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

SyntaxError: EOL while scanning string literal (<ipython-input-195-b4740d8100de>, line 1)

In [196]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: Dave Username: dave, Domain: google, Suffix: com

SyntaxError: EOL while scanning string literal (<ipython-input-196-74317ddd46b7>, line 1)

In [197]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [198]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail......: 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)

SyntaxError: invalid syntax (<ipython-input-198-1f36de114ecd>, line 1)

In [199]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [200]:
data = pd.Series(data)

In [201]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [202]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [203]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [204]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [205]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [206]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [207]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [208]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [209]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [210]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [211]:
data.str[2:3]

Dave       v
Steve      e
Rob        b
Wes      NaN
dtype: object